---
kind: other
id: Properties.T:Autodesk.Revit.DB.TransformWithBoundary
source: html/75d57c16-e47e-0ba0-1b81-0f77f78a08ec.htm
---
# TransformWithBoundary Properties

Specifies whether the .NET object represents a valid Revit entity.